<DIV class="border rounded p-4">
    <H1>授权协议</H1>
    <P>版权所有 (c) 2010-2022，Windy2000(windy_sk@126.com)</P>
    <P>感谢您选择 MyStep 内容管理系统。希望我们的努力能为您提供一个高效快速和强大的网站解决方案。</P>
    <P>本授权协议适用且仅适用于 MyStepCMS 1.x 版本，作者本人拥有对本授权协议的最终解释权。</P>
    <H3>I. 协议许可的权利</H3>
    <OL>
        <LI>您可以在完全遵守本最终用户授权协议的基础上，将本软件应用于非商业用途，而不必支付软件版权授权费用。</LI>
        <LI>您可以在协议规定的约束和限制范围内修改 MyStepCMS 源代码(如果被提供的话)或界面风格以适应您的网站要求。</LI>
        <LI>您拥有使用本软件构建的网站中全部内容的所有权，并独立承担与文章内容的相关法律义务。</LI>
        <LI>获得商业授权之后，您可以将本软件应用于商业用途，同时依据所购买的授权类型中确定的技术支持期限、技术支持方式和技术支持内容，自购买时刻起，在技术支持期限内拥有通过指定的方式获得指定范围内的技术支持服务。商业授权用户享有反映和提出意见的权力，相关意见将被作为首要考虑，但没有一定被采纳的承诺或保证。</LI>
    </OL>
    <H3>II. 协议规定的约束和限制</H3>
    <OL>
        <LI>未获商业授权之前，不得将本软件用于商业用途（包括但不限于企业网站、经营性网站、以营利为目或实现盈利的网站）。购买商业授权请联系作者了解详情。</LI>
        <LI>不得对本软件或与之关联的商业授权进行出租、出售、抵押或发放子许可证。</LI>
        <LI>无论如何，即无论用途如何、是否经过修改或美化、修改程度如何，只要使用 MyStepCMS 的整体或任何部分，未经书面许可，网站页面页脚处的作者及版权信息都必须保留，而不能清除或修改。</LI>
        <LI>禁止在 MyStepCMS 的整体或任何部分基础上以发展任何派生版本、修改版本或第三方版本用于重新分发。</LI>
        <LI>如果您未能遵守本协议的条款，您的授权将被终止，所被许可的权利将被收回，并承担相应法律责任。</LI>
    </OL>
    <H3>III. 有限担保和免责声明</H3>
    <OL>
        <LI>本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。</LI>
        <LI>用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未购买产品技术服务之前，作者不承诺提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。</LI>
        <LI>作者本人不对使用本系统构建网站中的文章或信息承担责任。</LI>
    </OL>
    <P>有关 MyStepCMS 最终用户授权协议、商业授权与技术服务的详细内容，均由 MyStepCMS 作者独家提供。作者拥有在不事先通知的情况下，修改授权协议和服务价目表的权力，修改后的协议或价目表对自改变之日起的新授权用户生效。</P>
    <P>电子文本形式的授权协议如同双方书面签署的协议一样，具有完全的和等同的法律效力。您一旦开始安装 MyStepCMS，即被视为完全理解并接受本协议的各项条款，在享有上述条款授予的权力的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。</P>
</DIV>
<DIV class="text-right mt-3 mb-5">
    <FORM method="post" action="install/1">
        <input type="hidden" name="step" value="1" />
        <button class="btn btn-info" type="submit">我同意</button>&emsp;
        <button class="btn btn-info" type="button" onclick="location.href='/'">我不同意</button>
    </FORM>
</DIV>